app/controllers/phrases_controller.rb

  def index
    @phrases = Phrase.all
---
SELECT "phrases".* FROM "phrases"

  def show
    @phrase = Phrase.find(params[:id])
---
SELECT  "phrases".* FROM "phrases" WHERE "phrases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @phrase = Phrase.new(phrase_params)
    @phrase.save!
---
INSERT INTO "phrases" ("content", "created_on") VALUES ($1, $2) RETURNING "id"  [["content", "hello world"], ["created_on", "2017-08-22 12:41:20.162857"]]