app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.all

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("handle", "content", "created_on") VALUES ($1, $2, $3) RETURNING "id"  [["handle", "espn"], ["content", "x"], ["created_on", "2017-08-24 15:33:19.790482"]]
---
  def create
    @tweet = Tweet.new(tweet_params)
    # @tweet.save!
    if @tweet.save!